{
  "utils": {
    "role": "Desenvolvedor Fullstack",
    "lang_options": {
      "en": "Inglês",
      "es": "Espanhol",
      "pt": "Português"
    },
    "theme": {
      "toggle": "Alternar tema",
      "light": "claro",
      "dark": "escuro"
    },
    "technologies": "Tecnologias",
    "nav": {
      "home": "Início",
      "about": "Sobre",
      "projects": "Projetos"
    },
    "date": "Data"
  },
  "home_page": {
    "hero_section": {
      "description": "Desenvolvedor de aplicações de ponta a ponta.",
      "read_more_about_me": "Leia mais sobre mim"
    }
  },
  "about_page": {
    "images_alt": {
      "profile": "Foto de perfil"
    },
    "software_developer_at": "Desenvolvedor de Software na",
    "resume": "Currículo",
    "resume_path": "/resume_pt_br.pdf",
    "description": "Sou um desenvolvedor focado tanto no backend quanto no frontend de aplicações. Atualmente, trabalho como desenvolvedor full-stack, lidando com todos os aspectos do projeto: frontend, backend, banco de dados e servidor. Gosto de entender a funcionalidade geral das aplicações e desenvolvê-las de ponta a ponta, mas minha especialidade é no desenvolvimento backend e configuração de servidores.",
    "experience": {
      "title": "Experiência",
      "responsibilities_title": "Responsabilidades",
      "technologies_title": "Tecnologias",
      "present_text": "Atualmente",
      "items": [
        {
          "role": "Desenvolvedor Fullstack",
          "company": "Farmpro",
          "start_date": "2022-11-03",
          "end_date": null,
          "description": "Desenvolvimento de aplicações de ponta a ponta para a gestão interna da empresa",
          "technologies": "HTML, CSS, JavaScript, Bootstrap, Python, Flask, ReactJS, MySQL, Heroku e Vercel.",
          "responsibilities": [
            "Gestão de recursos agrícolas: Fui responsável pela arquitetura e desenvolvimento completo de uma aplicação web para a gestão de mapas, atuando em todas as camadas: backend, frontend, banco de dados e servidor. No frontend, utilizei Next.js, TypeScript e Tailwind CSS, enquanto o backend foi desenvolvido em FastAPI. A plataforma permitia aos agricultores gerenciar diversos recursos do setor, como produtos, mapas de prescrição, clientes, unidades de trabalho, fazendas e talhões. Para o armazenamento de dados, optei pelo PostgreSQL devido ao suporte avançado a extensões, como JSON e LTree, essenciais para o projeto. O uso do LTree foi fundamental para representar a estrutura hierárquica de pastas, possibilitando organizar e relacionar recursos de forma hierárquica. Fiz o deploy desse projeto em um servidor Debian, utilizando Nginx como proxy e Supervisor para gerenciar backend.",
            "Estação meteorológica (weatherstation): Participei do desenvolvimento do backend em ExpressJS, responsável por receber dados enviados pelas estações meteorológicas e gerar relatórios para os fazendeiros com informações sobre o ambiente e o solo (como temperatura, velocidade do vento, máximas e mínimas diárias, umidade e taxa de potássio do solo, entre outros). Além disso, fui responsável pela arquitetura do servidor, configurando o Nginx como proxy reverso, o PM2 para gerenciamento de processos e serviços, e o MongoDB para armazenamento dos dados. Esses dados serão usados para análise e prover relatórios precisos, como por exemplo de qual a melhor época para cultivo.",
            "Relatórios de Leads com IA: Desenvolvi um sistema web utilizando ReactJS, Tailwind CSS e TypeScript para que os funcionários internos pudessem gerar relatórios a partir da base de dados do sistema externo LiveAgent. O backend, construído em FastAPI, integrava-se tanto à API do LiveAgent quanto à API da OpenAI. Para lidar com o grande volume de leads, implementei estratégias de processamento em batch e refinamento de prompts. Realizei o deploy da aplicação em um servidor Debian, utilizando MongoDB para armazenamento dos relatórios, Nginx como proxy reverso e Supervisor para gerenciar o serviço do FastAPI.",
            "Gerenciamento de Planilhas: Implementei planilhas automáticas alimentadas em tempo real pelo ERP da empresa. Para isso, desenvolvi scripts em Python que integravam a API do ERP com a do Google Sheets, configurados para execução periódica em um servidor Debian.",
            "Aplicativo Mobile: Desenvolvi um aplicativo em React Native para que os técnicos instaladores pudessem registrar fotos dos produtos instalados, garantindo maior controle e rastreabilidade das operações.",
            "Sistema Intranet: Criei um portal interno para gestão de recursos administrativos, incluindo notas fiscais, comissões, ordens de compra, funcionários e procedimentos. O frontend foi desenvolvido em React, TypeScript e Tailwind CSS, enquanto o backend foi implementado em FastAPI com MongoDB para persistência de dados.",
            "Telemetria/Observabilidade:  Utilizei o Sentry para monitorar as aplicações da empresa, coletando logs de erros e analisando requisições. Essa ferramenta permitiu identificar falhas e localizar gargalos de desempenho, auxiliando na otimização e maior confiabilidade dos sistemas.",
            "Configuração de serviços em Nuvem no GCP: Utilizei o Google Cloud para usar recursos em Nuvem, como Google Cloud Storage/Firebase para armazenar arquivos, Google Maps API para gerenciar coordenadas das fazendas, Google Spreadsheets API para se conectar à planilhas do google, Compute Engine para gerenciar os servidores, entre outros."
          ]
        },
        {
          "role": "Freelancer",
          "company": "Workana",
          "start_date": "2022-03-20",
          "end_date": "2022-11-03",
          "description": "Desenvolvimento e manutenção de aplicações web.",
          "technologies": "HTML, CSS, JavaScript, Bootstrap, Python, JQuery, Flask, ReactJS, MySQL e Heroku.",
          "responsibilities": [
            "Desenvolvimento de um editor web para a prefeitura utilizando a biblioteca Summernote com Jquery.",
            "Desenvolvimento de landing pages utilizando React e JavaScript",
            "Desenvolvimento de um bot para telegram utilizando Python, para o gerenciamento de milhas aéreas.",
            "Manutenção em site laravel hospedado na hostinger com mais de 500 mil requisições por mês.",
            "Melhoria em um site de gestão (KPIs e OKRs) desenvolvido em flask."
          ]
        }
      ]
    },
    "timeline": {
      "title": "Linha do Tempo",
      "items": [
        {
          "year": "2024",
          "items": [
            "Aprendi <a href='https://firebase.google.com' class='external-link'>Firebase</a>",
            "Aprendi <a href='https://www.mongodb.com' class='external-link'>MongoDB</a>",
            "Aprendi APIs do GCP: <a href='https://cloud.google.com/document-ai' class='external-link'>DocumentAI</a>",
            "Aprendi <a href='https://www.docker.com' class='external-link'>Docker</a>"
          ]
        },
        {
          "year": "2023",
          "items": [
            "Comecei a graduação em Análise de Sistemas de Computação na <a href='https://tuiuti.edu.br' class='external-link'>Universidade UTP</a>",
            "Aprendi a criar máquinas virtuais no <a href='https://cloud.google.com/' class='external-link'>GCP</a> e <a href='https://www.digitalocean.com' class='external-link'>Digital Ocean</a>",
            "Aprendi <a href='https://www.typescriptlang.org' class='external-link'>Typescript</a>",
            "Aprendi desenvolvimento de aplicativos móveis multiplataforma com <a href='https://reactnative.dev' class='external-link'>React Native</a> e <a href='https://expo.dev' class='external-link'>Expo</a>",
            "Aprendi desenvolvimento de APIs Rest com <a href='https://fastapi.tiangolo.com' class='external-link'>FastAPI</a>",
            "Aprendi APIs do GCP: <a href='https://developers.google.com/drive' class='external-link'>Google Drive API</a> e <a href='https://developers.google.com/sheets' class='external-link'>Sheets API</a>"
          ]
        },
        {
          "year": "2022",
          "items": [
            "Aprendi <a href='https://flask.palletsprojects.com' class='external-link'>Flask</a> e <a href='https://nodejs.org/' class='external-link'>NodeJS</a>",
            "Aprendi bancos de dados SQL com <a href='https://dev.mysql.com' class='external-link'>MySQL/MariaDB</a>",
            "Aprendi ferramentas de desenvolvimento frontend: <a href='https://getbootstrap.com' class='external-link'>Bootstrap</a>, <a href='https://tailwindcss.com' class='external-link'>Tailwind</a>, <a href='https://jquery.com' class='external-link'>Jquery</a>, <a href='https://react.dev' class='external-link'>ReactJS</a>",
            "Aprendi a fazer deploy de aplicações em produção com <a href='https://www.heroku.com' class='external-link'>Heroku</a> e <a href='https://vercel.com' class='external-link'>Vercel</a>",
            "Comecei a fazer trabalhos freelancer",
            "Comecei a trabalhar como desenvolvedor fullstack na Farmpro"
          ]
        },
        {
          "year": "2021",
          "items": [
            "Aprendi <a href='https://www.python.org' class='external-link'>Python</a>",
            "Aprendi <a href='https://git-scm.com' class='external-link'>Git</a> e <a href='https://github.com' class='external-link'>GitHub</a>",
            "Comecei um curso do governo do meu país para aprofundar no desenvolvimento de aplicações web",
            "Realizei meu primeiro trabalho remunerado usando Python."
          ]
        },
        {
          "year": "2020",
          "items": [
            "Aprendi o básico de <a href='developer.mozilla.org/docs/Web/HTML' class='external-link'>HTML</a>, <a href='https://developer.mozilla.org/en-US/docs/Web/CSS' class='external-link'>CSS</a> e <a href='https://developer.mozilla.org/docs/Web/JavaScript' class='external-link'>JavaScript</a>"
          ]
        }
      ]
    },
    "contact_placeholder_text": "Olá! Encontrei o seu contato através do seu portfólio..."
  },
  "projects_page": {
    "title": "Projetos",
    "description": "Aqui estão alguns projetos que eu desenvolvi.",
    "items": [
      {
        "name": "extractify",
        "description": "Meu projeto de TCC, uma aplicação web que permite extrair texto de arquivos de forma automatizada, como de imagens e pdfs, para gerar relatórios.",
        "github_repo": "https://github.com/ocr-extractify/extractify",
        "live_demo": null,
        "tools": [
          "ReactJS",
          "Typescript",
          "Shadcn/ui",
          "Tailwind",
          "Fastapi",
          "PostgresSQL",
          "Debian",
          "Nginx",
          "Supervisor",
          "Docker",
          "DocumentAI API",
          "Firebase",
          "Tesseract"
        ]
      },
      {
        "name": "file-to-text",
        "description": "Uma aplicação web simples que permite converter um arquivo em texto.",
        "github_repo": "https://github.com/ocr-extractify/file_to_text",
        "live_demo": "https://doc-to-text.vercel.app",
        "tools": [
          "ReactJS",
          "Typescript",
          "Tailwind",
          "Fastapi",
          "MongoDB",
          "Debian",
          "Nginx",
          "Supervisor",
          "Docker",
          "DocumentAI API"
        ]
      },
      {
        "name": "engineers-race",
        "description": "Esta aplicação foi desenvolvida para o projeto interdisciplinar na Universidade UTP.",
        "github_repo": "https://github.com/vittxr/engineers_race_app",
        "tools": [
          "ReactJS",
          "Typescript",
          "Tailwind",
          "Fastapi",
          "MariaDB",
          "Debian",
          "Nginx",
          "Supervisor"
        ]
      },
      {
        "name": "cli-hangman-game",
        "description": "Jogo da forca para jogar no terminal, feito com Python, para o trabalho da faculdade.",
        "github_repo": "https://github.com/vittxr/hangman_game",
        "tools": [
          "Python"
        ]
      },
      {
        "name": "cep-checker",
        "description": "Uma aplicação web simples que permite pesquisar endereços no Brasil usando o CEP.",
        "github_repo": "https://github.com/vittxr/cep-checker",
        "live_demo": "https://cep-checker.vercel.app",
        "tools": [
          "HTML",
          "CSS",
          "JavaScript",
          "API ViaCEP",
          "Vercel"
        ]
      },
      {
        "name": "todo-app",
        "description": "Um aplicativo de tarefas simples para desktop feito com Java.",
        "github_repo": "https://github.com/vittxr/todo-app",
        "tools": [
          "Java",
          "Mysql"
        ]
      },
      {
        "name": "wthcast",
        "description": "Uma aplicação web que permite pesquisar informações meteorológicas em qualquer cidade do mundo.",
        "github_repo": "https://github.com/vittxr/wthcast",
        "tools": [
          "HTML",
          "CSS",
          "JavaScript",
          "Flask",
          "OpenWeather API"
        ]
      },
      {
        "name": "snake-game",
        "description": "Um jogo da cobrinha simples feito com HTML, CSS e JavaScript.",
        "github_repo": "https://github.com/vittxr/SnakeGame",
        "live_demo": "https://snake-game-omega-blue.vercel.app",
        "tools": [
          "HTML",
          "CSS",
          "JavaScript"
        ]
      }
    ]
  }
}